//Каждая инструкция завершается точкой с запятой!!! (но можно и без них)
//Инструкции надо размещать через строку или хотябы на разных строках!!!

//Любая строка содержащая let или const является инструкцией

let a; //выполняет действие

const b = 5; 


//Если есть { это блок инструкций } то точка с запятой не обязательна

if (a > b) {
    console.log('fff');
}

for (let i = 0; i++; i < 5); {
    console.log(i);
}

// Выражение может быть инструкцией

'abc';

a = a + 3;

c = a + b;

d = 'Good' + 'Evening';

myFn(c, d);

console.log('Hey');

// Как отличить виражение от инструкции?

// Выражения могут быть использованы как аргументы в вызовах функции

// Инструкции не могут быть использованы как аргументы в вызовах функции



